app/controllers/lancamentos_controller.rb

SELECT * FROM "lancamentos" ORDER BY data DESC
---
  def index

	 if(params[:date])
		@year = Integer(params[:date][:year])
		@month = Integer(params[:date][:month])
     end
	 if(!params[:month].nil? &&
		!params[:year].nil?)
		@year = Integer(params[:year])
		@month = Integer(params[:month])
     end

     requested_date = Date.new(@year, @month, 1)
     from = requested_date
  	 to =  (requested_date >> 1) - 1

  	 @lancamentos = Lancamento.all(:order => 'data',:conditions => ['data BETWEEN ? AND ?',from, to] )

SELECT * FROM "lancamentos" WHERE ("lancamentos"."id" = 1)
---
  def show
    @lancamento = Lancamento.find(params[:id])

SELECT * FROM "lancamentos" WHERE ("lancamentos"."id" = 1)
---
  def edit
    @lancamento = Lancamento.find(params[:id])

INSERT INTO "lancamentos" ("horas", "updated_at", "saida", "almoco", "total", "entrada", "horas_extras", "descricao", "data", "created_at") VALUES(1.0, '2009-11-24 15:58:11', '2009-11-24 01:00:00', 'f', 1.0, '2009-11-24 00:00:00', NULL, 'xxx', '2009-11-24', '2009-11-24 15:58:11')
---
  def create
    @lancamento = Lancamento.new(params[:lancamento])

    respond_to do |format|
      if @lancamento.save

SELECT * FROM "lancamentos" WHERE ("lancamentos"."id" = 1)
UPDATE "lancamentos" SET "total" = 12.0, "saida" = '2000-01-01 23:00:00', "horas_extras" = 4.0, "updated_at" = '2009-11-19 16:23:13' WHERE "id" = 3
---
  def update
    @lancamento = Lancamento.find(params[:id])

    respond_to do |format|
      if @lancamento.update_attributes(params[:lancamento])

SELECT * FROM "lancamentos" WHERE ("lancamentos"."id" = 2)
DELETE FROM "lancamentos" WHERE "id" = 2
---
  def destroy
    @lancamento = Lancamento.find(params[:id])
    @lancamento.destroy